Revit 2026 API

# MEPSystemGetSectionByNumber Method

---

Get the Section from section number

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MEPSection GetSectionByNumber(
	int sectionNumber
)
```
```vb
Public Function GetSectionByNumber (
	sectionNumber As Integer
) As MEPSection
```
```cpp
public:
MEPSection^ GetSectionByNumber(
	int sectionNumber
)
```
```fsharp
member GetSectionByNumber :
        sectionNumber : int -> MEPSection
```

#### Parameters

sectionNumber Int32
     The Section number.

#### Return Value

MEPSection The section.  if the no section exists for the input section number.

#### Reference

MEPSystem Class

Autodesk.Revit.DB Namespace